<template>
  <div class="ml-8">
    <chat-message 
        class="ma-5" 
        :imgs-links="imgs"
        :text="text"
        :date="data" 
        username="Екатерина Некрасова"
        :attachments="files"
    />
  </div>
</template>

<script>
import ChatMessage from "@/components/ChatMessage";

export default {
  name: 'HomeView',
  data() {
    return {
      people: [],
      human: '',
      humanId: '',
      files: [
        {thumbnailUrl: 'https://cambridge.ua/app/uploads/2022/12/wednesday2-1.jpg', downloadUrl: '', type: 'video'}, 
      ],
      imgs: [
        //'https://avatars.mds.yandex.net/i?id=657ea1cca0e664ed8c2046ab7148bd95-5220947-images-thumbs&n=13&exp=1',
        // 'https://avatars.mds.yandex.net/i?id=2a00000184de30a3be964f1106ea62c65f77-774647-fast-images&n=13&exp=1',
        // 'https://avatars.mds.yandex.net/i?id=2a00000184debd032ee75d3582c9a7aa1de7-1616940-fast-images&n=13&exp=1',
        // 'https://cdnn11.img.sputnik.by/img/07e6/0c/04/1069786631_0:0:2769:2047_1920x0_80_0_0_84a240910d736e4d67c2dbb290354eac.jpg',
        // 'https://cdnn21.img.ria.ru/images/07e6/0c/05/1836294920_0:0:3090:1738_1920x0_80_0_0_1602db465b4ec6cc59916ca204ade589.jpg',
      ],
      text: 'День',
          // 'Разнообразный и богатый опыт начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки соответствующих условий активизации. Соображения высшего порядка, а также повышение уровня гражданского сознания влечет за собой процесс внедрения и модернизации дальнейших направлений развития проекта. Дорогие друзья, курс на социально-ориентированный национальный проект обеспечивает широкому кругу специалистов участие в формировании системы масштабного изменения ряда параметров.Таким образом, рамки и место обучения кадров создаёт предпосылки качественно новых шагов для экономической целесообразности принимаемых решений. Дорогие друзья, консультация с профессионалами из IT в значительной степени обуславливает создание модели развития. Равным образом начало повседневной работы по формированию позиции способствует повышению актуальности всесторонне сбалансированных нововведений. Повседневная практика показывает, что консультация с профессионалами из IT влечет за собой процесс внедрения и модернизации модели развития.',
      data: new Date(),
    }
  },
  components: {
    ChatMessage,

  },
  methods: {
    gett() {
      this.$refs.headerButtons.gett();
    },
  },
}
</script>
